def area(a, b):
    Возвращает площадь прямоугольника

    Параметры:
    a - длина одной из сторон прямоугольника
    b - длина другой стороны прямоугольника

    Возвращаемое значение:
    Площадь прямоугольника, вычисленная по формуле a * b
    return a * b 

def perimeter(a, b):
    Возвращает периметр прямоугольника

    Параметры:
    a - длина одной из сторон прямоугольника
    b - длина другой стороны прямоугольника

    Возвращаемое значение:
    Периметр прямоугольника, вычисленная по формуле 2*(a + b)
    return 2*(a + b)
