def area(a, h): 
    '''
    Возвращает площадь треугольника

    Параметры:
    a - длина основание треугольника
    h - длина высоты треугольника

    Возвращаемое значение:
    Площадь треугольника, вычисленная по формуле a * h / 2
    '''
    return a * h / 2 

def perimeter(a, b, c):
    '''
    Возвращает периметр треугольника

    Параметры:
    a - длина первой стороны треугольника
    b - длина второй стороны треугольника
    c - длина третьей стороны треугольника
    

    Возвращаемое значение:
    Периметр треугольника, вычисленный по формуле a + b + с
    '''
    return a + b + c 
